package javase03;

public class For {
    public static void main(String[] args) {
        /*
        for(循环变量初始化;循环条件;循环变量迭代
        循环操作(语句);
    }
        1. for关键字，表示循环控制
        2. for有四要素: (1)循环变量初始化(2)循环条件(3)循环操作(4)循环变量迭代
        3.循环操作,这里可以有多条语包，也就是我们要循环执行的代码
        4.如果循环操作(语句)只有一条语句，可以省略{},建议不要省略
        */
        //细节
        /*
        1)循环条件是返回-个布尔值的表达式
        2) for(;循环判断条件:)中的初始化和变量迭代可以写到其它地方，但是两边的分
        号不能省略。
        3)循环初始值可以有多条初始化语句，但要求类型一一样，并且中间用逗号隔开，
        循环变量迭代也可以有多条变量迭代语句，中间用逗号隔开。
        4)使用内存分析法，老师分析输出下面代码输出什么?
        int count = 3;
        for (inti = 0,j= 0; i < count; i++,j+= 2) {
            System.out.println("i=""+i+"j="+ j);
        */
        }
}
